Documents/ИзменениеСтатусаГотовностиРезервистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеСтатусаГотовностиРезервистов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьСтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.СтатусыГотовностиРезервистов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчастникКадровогоРезерва</Name>
							<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыГотовностиРезервистов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизическоеЛицо</Name>
							<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИзменениеСтатусаГотовностиРезервистов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		Объект.Подразделение = Параметры.Подразделение;
		ЗаполнитьИнформациюОКадровомРезерве(Параметры.УчастникКадровогоРезерва);
	Иначе
		ОбновитьСтатусыРезервистов();
	КонецЕсли;

	УстановитьВидимостьЭлементов();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПодразделениеПрежнее = Объект.Подразделение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьСтатусыРезервистов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписаноИзменениеСтатусаГотовностиРезервистов");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьСтатусыРезервистов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	КадровыйРезервКлиент.ПодразделениеПриИзменении(ЭтотОбъект, "Сотрудники");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиУчастникКадровогоРезерваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УчастникКадровогоРезерва = Элементы.Сотрудники.ТекущиеДанные.УчастникКадровогоРезерва;
	
	Если ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		СтандартнаяОбработка = Ложь;
		КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(Элемент, , , Объект.Дата,
			Ложь);
	ИначеЕсли ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		СтандартнаяОбработка = Ложь;
		МодульПодборПерсоналаКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодборПерсоналаКлиент");
		Отбор = Новый Структура;
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			Отбор.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		МодульПодборПерсоналаКлиент.ПодобратьКандидатов(Элемент, Отбор, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУчастникКадровогоРезерваОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СотрудникиУчастникКадровогоРезерваОбработкаВыбораНаСервере(ВыбранноеЗначение, Элементы.Сотрудники.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДобавитьВыбранныхСотрудников(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПодобратьСотрудников();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодобратьКандидатов(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсоналаКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодборПерсоналаКлиент");
		Отбор = Новый Структура;
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			Отбор.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		МодульПодборПерсоналаКлиент.ПодобратьКандидатов(Элементы.Сотрудники, Отбор);
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// См. КадровыйРезервФормы.ОтборИзПодразделения
&НаСервереБезКонтекста
Функция ОтборИзПодразделения(Знач Подразделение)

	Возврат КадровыйРезервФормы.ОтборИзПодразделения(Подразделение);

КонецФункции

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	СписокСотрудниковПоФизическимЛицам = ТаблицаСотрудниковИФизлиц(
		Объект.Сотрудники.Выгрузить(,"УчастникКадровогоРезерва").ВыгрузитьКолонку("УчастникКадровогоРезерва"));
	Возврат ПоместитьВоВременноеХранилище(СписокСотрудниковПоФизическимЛицам.ВыгрузитьКолонку("Сотрудник"),
		УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаСотрудниковИФизлиц(СписокФизическихЛиц)
	
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыСотрудников.СписокФизическихЛиц = СписокФизическихЛиц;
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаСотрудников = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыСотрудников);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТаблицаСотрудников;
	
КонецФункции

&НаСервере
Процедура ДобавитьВыбранныхСотрудников(Знач ВыбранноеЗначение)
	
	ВыбранныеСотрудники = ОбщегоНазначения.СкопироватьРекурсивно(ВыбранноеЗначение);
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(ВыбранныеСотрудники,
		Тип("СправочникСсылка.Сотрудники"));
	ФизическиеЛица = КадровыйУчет.ФизическиеЛицаСотрудников(ВыбранныеСотрудники);
	ЗаполнитьИнформациюОКадровомРезерве(ФизическиеЛица);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		ЛичныеДанныеКандидатов = МодульПодборПерсонала.СсылкиНаЛичныеДанныеКандидатов(ВыбранноеЗначение);
		ЗаполнитьИнформациюОКадровомРезерве(ЛичныеДанныеКандидатов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОКадровомРезерве(УчастникиКадровогоРезерва)
	
	Если Не ЗначениеЗаполнено(УчастникиКадровогоРезерва) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияОРезерве = ИнформацияОКадровомРезерве(УчастникиКадровогоРезерва);
	
	Для Каждого СтрокаРезерв Из ИнформацияОРезерве Цикл
		ОтборСтрок = Новый Структура("УчастникКадровогоРезерва, ПозицияРезерва");
		ОтборСтрок.УчастникКадровогоРезерва = СтрокаРезерв.УчастникКадровогоРезерва;
		ОтборСтрок.ПозицияРезерва = СтрокаРезерв.ПозицияРезерва;
		НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Сотрудники.Добавить();
			НоваяСтрока.УчастникКадровогоРезерва = СтрокаРезерв.УчастникКадровогоРезерва;
			НоваяСтрока.ПозицияРезерва = СтрокаРезерв.ПозицияРезерва;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьСтатусыРезервистов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыРезервистов()
	
	Если Объект.Сотрудники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиДокумента = Объект.Сотрудники.Выгрузить();
	
	СтатусыРезервистов = КадровыйРезерв.СтатусыГотовностиРезервистов(Объект.Дата,
		СотрудникиДокумента.ВыгрузитьКолонку("ПозицияРезерва"),
		СотрудникиДокумента.ВыгрузитьКолонку("УчастникКадровогоРезерва"), Объект.Ссылка);
	
	Для Каждого СтрокаСотрудник Из Объект.Сотрудники Цикл
		ОтборСтрок = Новый Структура("УчастникКадровогоРезерва, ПозицияРезерва");
		ОтборСтрок.УчастникКадровогоРезерва = СтрокаСотрудник.УчастникКадровогоРезерва;
		ОтборСтрок.ПозицияРезерва = СтрокаСотрудник.ПозицияРезерва;
		НайденныеСтроки = СтатусыРезервистов.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаСотрудник.ПредыдущийСтатус = НайденныеСтроки[0].Статус;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИнформацияОКадровомРезерве(УчастникКадровогоРезерва)
	
	Возврат КадровыйРезерв.ПозицииРезерваПоУчастникуКадровогоРезерва(УчастникКадровогоРезерва, Объект.Дата,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.СостоянияСогласования.Согласовано));
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	ТипыУчастниковКадровогоРезерва = КадровыйРезерв.ТипыУчастниковКадровогоРезерваДоступныхПоФункциональнымОпциям();
	НесколькоТиповУчастников = ТипыУчастниковКадровогоРезерва.Количество() > 1;
	Если НесколькоТиповУчастников Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиПодбор", "Видимость",
			Ложь);
		КадровыйРезервФормы.ДополнитьКомандыИКнопкиПодбора(ЭтотОбъект, "СотрудникиКоманднаяПанель", "Сотрудники");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиУчастникКадровогоРезерваОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущаяСтрока)
	
	ТекущиеДанные = Объект.Сотрудники.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТекущиеДанные.УчастникКадровогоРезерва = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение,
			"ФизическоеЛицо");
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Кандидаты") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		ТекущиеДанные.УчастникКадровогоРезерва = МодульПодборПерсонала.ЛичныеДанныеКандидатов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение)).Получить(ВыбранноеЗначение);
	Иначе
		ТекущиеДанные.УчастникКадровогоРезерва = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников()
	
	ОтборИзПодразделения = ОтборИзПодразделения(Объект.Подразделение);
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтборИзПодразделения, "Организация");
	Подразделение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтборИзПодразделения, "Подразделение");
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(Элементы.Сотрудники,
		Организация, Подразделение, Объект.Дата, , АдресСпискаПодобранныхСотрудников());
	
КонецПроцедуры

#КонецОбласти
